kenchaan/PicWorking/project/SimpleThermoMeter/source/SimpleThermoMeter.X/source/PIC16F886_hardware_rom.c
/*******************************************************************************
*	Author		|	Date		|	FileName
*-------------------------------------------------------------------------------
*	kenchaan	|	2019/01/29	|	PIC16F886_hardware_rom.c
*-------------------------------------------------------------------------------
*	Description	|	[PIC16F886]ROM制御
*-------------------------------------------------------------------------------
*	Copyright (c) 2019 kenchaan All Rights Reserved.
*******************************************************************************/

/*------------------------------------------------------------------------------
*	include
*-----------------------------------------------------------------------------*/
#include <xc.h>
#include "types.h"
#include "regaccess.h"
#include "hardware.h"
#include "hardware_interrupt.h"
#include "hardware_rom.h"

/*------------------------------------------------------------------------------
*	pragma
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	define
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	macro
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	typedef
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	enum
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	struct
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	static variable
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	static function prototype
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	static const data
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	extern const data
*-----------------------------------------------------------------------------*/


/*------------------------------------------------------------------------------
*	function
*-----------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------
* OverView	: ROM初期化
* Parameter	: None
* Return	: None
*-----------------------------------------------------------------------------*/
void HW_ROM_Initialize( void )
{
	REG_WRITE_08( EECON1, 0x00 );
}

/*------------------------------------------------------------------------------
* OverView	: ROM読み出し
* Parameter	: addr	: 読み出しアドレス
* Return	: 読み出し値
*-----------------------------------------------------------------------------*/
U08 HW_ROM_Read( const U08 addr )
{
	/* 書き込み/読み出し待ち */
	while(( REG_READ_08( EECON1 ) & 0x03 ) != 0 );

	/* アドレス設定 */
	REG_WRITE_08( EEADR, addr );

	/* 読み出し */
	REG_SET_08( EECON1, 0x01 );
	while(( REG_READ_08( EECON1 ) & 0x03 ) != 0 );

	return REG_READ_08( EEDAT );
}

/*------------------------------------------------------------------------------
* OverView	: ROM書き込み
* Parameter	: addr	: 書き込みアドレス
* 			: data	: 書き込み値
* Return	: None
*-----------------------------------------------------------------------------*/
void HW_ROM_Write( const U08 addr, const U08 data )
{
	/* 書き込み/読み出し待ち */
	while(( REG_READ_08( EECON1 ) & 0x03 ) != 0 );

	/* アドレス/書き込み値設定 */
	REG_WRITE_08( EEADR, addr );
	REG_WRITE_08( EEDAT, data );

	/* 書き込み許可 */
	REG_SET_08( EECON1, 0x04 );

	/* 割り込み禁止 */
	HW_INT_EnableAll( FALSE );

	/* 書き込み */
	REG_SET_08( EECON2, 0x55 );
	REG_SET_08( EECON2, 0xAA );
	REG_SET_08( EECON1, 0x02 );

	/* 割り込み許可 */
	HW_INT_EnableAll( TRUE );

	/* 書き込み/読み出し待ち */
	while(( REG_READ_08( EECON1 ) & 0x03 ) != 0 );

	/* 書き込み禁止 */
	REG_CLR_08( EECON1, 0x04 );
}


/*------------------------------------------------------------------------------
*	End Of File
*-----------------------------------------------------------------------------*/
